tap "homebrew/bundle"
tap "homebrew/core"
tap "superfly/tap"
tap "cloudflare/cloudflare"

brew "libpng"
brew "libffi"
brew "libtool"
brew "asdf"
brew "aws-vault"
brew "awscli"
brew "bat"
brew "cmake"
brew "cocoapods"
brew "coreutils"
brew "curl"
brew "fd"
brew "fzf"
brew "gcc"
brew "gh"
brew "git"
brew "gitui"
brew "git-delta"
brew "glow"
brew "gnupg"
brew "grpcurl"
brew "gource"
brew "hyperfine"
brew "icu4c"
brew "lsd"
brew "mitmproxy"
brew "neovim"
brew "opam"
brew "pnpm"
brew "protobuf"
brew "prototool"
brew "ripgrep"
brew "shellcheck"
brew "tmux"
brew "watchman"
brew "wget"
brew "yarn"
brew "zoxide"
brew "zsh"

brew "cloudflare/cloudflare/cloudflared"
brew "superfly/tap/flyctl"

if OS.linux?
  brew "pinentry"
end

if OS.mac?
  tap "homebrew/cask"
  tap "homebrew/cask-versions"
  tap "homebrew/cask-fonts"

  brew "reattach-to-user-namespace"
  brew "pinentry-mac"

  cask "1password"
  cask "1password-cli"
  cask "adobe-creative-cloud"
  cask "alacritty"
  cask "aws-vpn-client"
  cask "discord"
  cask "figma"
  cask "firefox-developer-edition"
  cask "google-chrome"
  cask "keeweb"
  cask "keybase"
  cask "keycastr"
  cask "microsoft-auto-update"
  cask "microsoft-office"
  cask "ngrok"
  cask "notion"
  cask "sizzy"
  cask "slack"
  cask "typora"
  cask "visual-studio-code"
  cask "zoom"

  cask "font-hack-nerd-font"
  cask "font-noto-sans-cjk"
  cask "font-noto-sans-cjk-kr"
  cask "font-sf-pro"
end
