brew "asdf"
brew "aws-vault"
brew "awscli"
brew "bat"
brew "cloudflared"
brew "cmake"
brew "code-minimap"
brew "fd"
brew "fontconfig"
brew "fzf"
brew "gcc"
brew "gh"
brew "git"
brew "gitui"
brew "git-delta"
brew "glow"
brew "gnupg"
brew "gource"
brew "hyperfine"
brew "lsd"
brew "mise"
brew "neovim"
brew "pnpm"
brew "ripgrep"
brew "shellcheck"
brew "taplo"
brew "watchman"
brew "wget"
brew "yarn"
brew "zellij"
brew "zoxide"

# HTTP/3 enabled cURL
brew "cloudflare/cloudflare/curl"

if OS.linux?
  brew "pinentry"
  brew "zsh"
end

if OS.mac?
  brew "gnu-tar"
  brew "reattach-to-user-namespace"
  brew "pinentry-mac"

  tap "jorgelbg/tap"
  brew "jorgelbg/tap/pinentry-touchid"

  cask "1password"
  cask "1password-cli"
  cask "alacritty"
  cask "android-platform-tools"
  cask "discord"
  cask "figma"
  cask "firefox@developer-edition"
  cask "google-chrome"
  cask "keeweb"
  cask "keybase"
  cask "keycastr"
  cask "ngrok"
  cask "notion"
  cask "orbstack"
  cask "sizzy"
  cask "slack"
  cask "typora"
  cask "visual-studio-code"
  cask "zoom"

  tap "homebrew/cask-fonts"
  cask "font-hack-nerd-font"
  cask "font-noto-sans-cjk"
  cask "font-noto-sans-cjk-kr"
  cask "font-sf-pro"
end
